* TODO Learn enough CSS [33%]
  :LOGBOOK:
  CLOCK: [2017-07-24 Mon 20:37]--[2017-07-24 Mon 21:02] =>  0:25
  CLOCK: [2017-07-23 Sun 12:14]--[2017-07-23 Sun 12:39] =>  0:25
  CLOCK: [2017-07-22 Sat 22:38]--[2017-07-22 Sat 23:03] =>  0:25
  CLOCK: [2017-07-19 Wed 22:37]--[2017-07-19 Wed 23:02] =>  0:25
  :END:
  - xdg-open <filename>
** DONE Intro [100%]
   CLOSED: [2017-07-11 Tue 01:13]
*** DONE front end dev
    CLOSED: [2017-07-09 Sun 22:57]
*** DONE Overview
    CLOSED: [2017-07-09 Sun 23:15]
*** DONE Sample site setup
    CLOSED: [2017-07-10 Mon 22:28]
*** DONE Start
    CLOSED: [2017-07-10 Mon 23:33]
*** DONE Selectors
    CLOSED: [2017-07-11 Tue 01:12]
** DONE Style [100%]
   CLOSED: [2017-07-11 Tue 23:25]
*** DONE Naming
    CLOSED: [2017-07-11 Tue 21:54]
*** DONE When/why
    CLOSED: [2017-07-11 Tue 22:05]
*** DONE priority
    CLOSED: [2017-07-11 Tue 22:32]
*** DONE Good citizen
    CLOSED: [2017-07-11 Tue 23:05]
    - modular - styles should only affect things inside of modules rather than site-wide.
    - aim to keep it simple
    - multiple classes when things need to be slightly different bc context
    - use id only if absolutely necessary - default to classes
    - rule of thumb: three selectors maximum
    - make good decisions early to avoid work later
** DONE Values: Color, size [100%]
   CLOSED: [2017-07-23 Sun 13:11]
*** DONE Color
    CLOSED: [2017-07-19 Wed 22:36]
   - rgba transparency needs leading zero eg 0.5
*** DONE intro sizing
    CLOSED: [2017-07-19 Wed 22:45]
*** DONE pixels
    CLOSED: [2017-07-19 Wed 22:53]
    - some places work better with absolute sizing eg. margins and padding
*** DONE percentages
    CLOSED: [2017-07-19 Wed 23:04]
*** DONE em
    - em mainly for font 
    CLOSED: [2017-07-22 Sat 22:53]
*** DONE rem
    CLOSED: [2017-07-23 Sun 12:25]
    - make modular code by setting top level of chunk at rem  unit and using em for children
*** DONE vw vh
    CLOSED: [2017-07-23 Sun 13:00]
    - viewport height, viewport width
    - each is 1% :: 100vw equals full width
    - should use different setups for desktop, mobile, etc. 
*** DONE pleasing fonts
    CLOSED: [2017-07-23 Sun 13:11]
** TODO Box Model [25%]
*** DONE inline vs block
    CLOSED: [2017-07-24 Mon 20:49]
*** DONE margins padding borders
    CLOSED: [2017-07-24 Mon 21:02]
*** TODO Floats
*** TODO Overflow style
*** TODO Inline Block
*** TODO Box Margins
*** TODO Padding - Chairs
*** TODO Border fun
** TODO Laying it all out [%]
*** TODO basics
*** TODO Jekyll
*** TODO Layouts, includes, pages
*** TODO layout file
*** TODO CSS file/reset
*** TODO includes intro
*** TODO advanced selectors
*** TODO positioning
*** TODO fixed header
*** TODO footer, includes in includes
** TODO Specialty layout - flexbox [%]
** TODO adding a blog [%]
** TODO Mobile media queries [%]
** TODO more little touches [%]

* TODO Learn Enough Ruby [%]
  - Do before catching up on ODIN?

* TODO Rails Tutorial [%]
  -use this but make your own site
  -Hart.io? 
  -Make logo and all of that
  -styling with css
  -put everything together and make this a serious things
  -plan for it to be your portfolio/business site
  
* TODO Viking [%] 
** TODO Front End
*** TODO HTML/CSS
**** TODO Resume Finish HTML
**** TODO CSS Garden
**** TODO Lorem Ipsum Blog
**** TODO Facebook CSS projects
*** TODO SASS
*** TODO Bootstrap
** TODO Javascript
** TODO Ruby
** TODO Getting hired phase 1

* TODO ODIN [0%] 
** Clean up odds n ends 
** TODO Rails
*** TODO Forms project
*** TODO Members only
*** TODO Associations
*** TODO Advanced Associations
*** TODO Advanced Forms
*** TODO APIs
*** TODO Confirmation Email
*** TODO Final Project
** TODO HTML/CSS
*** TODO Embedding img/vid
*** TODO HTML Forms
*** TODO Position/Float elements
*** TODO Backgrounds/gradients
*** TODO Design teardown
*** TODO Responsive design
*** TODO Bootstrap
*** TODO Grid Framework
** TODO Javascript/JQUERY
*** TODO Calculator
*** TODO Manipulating DOM
*** TODO Jquery and DOM
*** TODO Image Carousel
*** TODO Tic Tac Toe
*** TODO Minesweeper
*** TODO Callbacks
*** TODO Games with canvas
*** TODO Validating with Jquery
*** TODO Infinite scroll/submitting form with AJAX
*** TODO Google maps
*** TODO Wheres waldo
*** TODO Single Page websites angular/backbone
*** TODO Node.js
*** TODO Final
** TODO Getting Hired
*** TODO Website
*** TODO Resume

* TODO FreeCodeCamp [%] 
** TODO Check it out - good resume builder

* TODO Codewars
** TODO Try making a habit of one or two each day in the morning
